{
    "id": "7",
    "title": "Приём 7: Контрпример, или подтверждающий пример",
    "description": [
        {"type": "text", "content": "Данный эвристический приём используется в основном для доказательства истинности того или иного суждения. Если суждение ложно, то в доказательство этому приводится контрпример, если оно истинно – подтверждающий пример."}
    ],
    "themes": [
        {
            "id": "1",
            "title": "Поиск примера, контрпримера",
            "example": {
                "task": "Существует ли арифметическая прогрессия из 2011 натуральных чисел, в которой количество чисел, делящихся на 8, меньше, чем количество чисел, делящихся на 9, а последнее, в свою очередь, меньше, чем количество чисел, делящихся на 10?",
                "solution": [
                    {"type": "text", "content": "Рассмотрим арифметическую прогрессию с начальным членом 10 и разностью 40:"},
                    {"type": "text", "content": "10, 50, 90, 130, 170, 210, 250, 290, ..."},
                    {"type": "text", "content": "Начальный член не делится на 8, а разность делится. Значит, ни один член последовательности не делится на 8. По выписанному куску последовательности видно, что некоторые члены делятся на 9, а некоторые — нет. И наконец, ясно, что все члены последовательности делятся на 10."}
                ],
                "answer": "да"
            },
            "tasks": [
                {
                    "task": "В ряд выписаны несколько натуральных чисел с суммой 20. Никакое число и никакая сумма нескольких подряд записанных чисел не равна 3. Могло ли быть выписано больше 10 чисел?",
                    "hints": ["Найдите соответствующий подтверждающий пример."]
                },
                {
                    "task": "Существуют ли такие натуральные числа MATH{$a$, $b$, $c$, $d$},что MATH{\\[a{}^\\text{3}\\text{ }+~b{}^\\text{3}\\text{ }+~c{}^\\text{3}\\text{ }+~d{}^\\text{3}\\text{ }=\\text{ }{{100}^{100}}~\\]}?",
                    "hints": [
                        "Найдите соответствующий подтверждающий пример."
                    ]
                },
                {
                    "task": "Сумма девяти различных натуральных чисел равна 200. Всегда ли можно выбрать из них четыре числа так, чтобы их сумма была больше чем 100?",
                    "hints": [
                        "Найдите соответствующий контрпример."
                    ]
                },
                {
                    "task": "Существует ли кусочно-линейная функция MATH{$f$}, определённая на отрезке MATH{\\[\\left[ 1,1 \\right]~\\]} (включая концы), для которой MATH{\\[f\\left( f\\left( x \\right) \\right)=~x~\\]} при всех MATH{\\[x\\]}? (Функция называется кусочно-линейной, если её график есть объединение конечного числа точек и интервалов прямой; она может быть разрывной.)",
                    "hints": [
                        "Найдите соответствующий подтверждающий пример."
                    ]
                }
            ]
        }
    ]
}