{
    "id": "8",
    "title": "Приём 8: Доказательство методом \"от противного\"",
    "description": [
        {"type": "text", "content": "Доказать справедливость утверждения «Если А, то В»  MATH{$(A\\Rightarrow B)$} «от противного» - это значит, вместо утверждения MATH{$(A\\Rightarrow B)$} доказать одно из следующих равносильных ему утверждений:"},
        {"type": "text", "content": "1) из предположения истинности А и ложности В вывести какое-нибудь противоречие: два взаимоисключающих друг друга высказывания;"},
        {"type": "text", "content": "2) из предположения истинности А и ложности В вывести, что А ложно;"},
        {"type": "text", "content": "3) из предположения истинности А и ложности В вывести, что В ложно;"},
        {"type": "text", "content": "4) из предположения истинности А и ложности В вывести, что В истинно."}
    ],
    "themes": [
        {
            "id": "1",
            "title": "Доказательство утверждений",
            "example": {
                "task": "а) Есть кусок сыра. Разрешается выбрать любое положительное (возможно, нецелое) число MATH{\\[a\\ne 1\\]}, и разрезать этот кусок в отношении MATH{$1:a$} по весу, затем разрезать в том же отношении любой из имеющихся кусков, и т. д. Можно ли действовать так, что после конечного числа разрезаний весь сыр удастся разложить на две кучки равного веса? б) Тот же вопрос, но выбирается положительное рациональное MATH{\\[a\\ne 1\\]}",
                "solution": [
                    {"type": "text", "content": "  а) Разрезание в отношении MATH{$1:a$} равносильно отрезанию доли MATH{$\\frac{a}{a+1}$}. Выберем такое MATH{$a$}, что MATH{$\\frac{a}{a+1}=\\frac{1}{\\sqrt{2}}$}, и разрежем во второй раз наибольший из кусков. Тогда вес самого большого из полученных кусков равен половине веса всего сыра."},
                    {"type": "text", "content": "б) Допустим противное: после нескольких разрезаний удалось разбить все куски на две равные кучки. Без ограничения общности можно считать, что мы резали на каждом шагу все имеющиеся куски. После MATH{$k$} шагов получились куски, чьи веса относятся как MATH{\\[1:a:a{}^\\text{2}:...:{{a}^{k}}\\]}, причём 1 и MATH{\\[{{a}^{k}}\\]} соответствует ровно по одному куску. Подставив вместо a несократимую дробь MATH{\\[^{m}{{/}_{n}}~\\]} и умножив все веса на подходящую константу, получим целые веса MATH{\\[{{n}^{k}},m{{n}^{k}}^{1},...,~{{m}^{k}}.~\\]} MATH{$m$} и MATH{$n$} взаимно просты, поэтому вес одной кучки кратен MATH{$m$}, а другой, где есть кусок веса MATH{\\[{{n}^{k}}\\]}, не кратен. Противоречие."}
                ],
                "answer": "а) Можно. б) Нельзя."
            },
            "tasks": [
                {
                    "task": "1000 яблок разложены в несколько корзин. Можно убирать корзины и вынимать яблоки из корзин. Докажите, что можно добиться того, чтобы во всех корзинах стало поровну яблок и общее число оставшихся яблок было не меньше 100.",
                    "hints": [
                        "Рассуждая от противного, оцените количество корзин, в которых вначале было не меньше одного яблока, не меньше двух яблок и т.д."
                    ]
                },
                {
                    "task": "Каждое целое число на координатной прямой покрашено в один из двух цветов – белый или чёрный, причём числа 2016 и 2017 покрашены разными цветами. Обязательно ли найдутся три одинаково покрашенных целых числа, сумма которых равна нулю?",
                    "hints": [
                        "Подсказка 1. Рассуждая от противного, рассмотрите два случая: когда число 0 – белое и когда – чёрное."
                    ]
                },
                {
                    "task": "Имеется несколько камней, масса каждого из которых не превосходит 2 кг, а общая масса равна 100 кг. Из них выбирается несколько камней, суммарная масса которых отличается от 10 кг на наименьшее возможное для данного набора число MATH{$d$}. Какое максимальное значение может принимать число MATH{$d$} для всевозможных наборов камней?",
                    "hints": [
                        "Определите число MATH{$d$} для 55 камней."
                    ]
                }
            ]
        }
    ]
}